[{"pageContent":"list a propertyServicesBuyRentSellProperty ManagementMortgagesOff PlanHoliday HomesCommercialaboutAbout UsDubai CommunitiesNewsCareersVideosCustomer ReviewsPeopleContactGeneral EnquiryList a PropertyCareers / Send us your CVLeave A SuggestionAbout White & CoDubai’s fastest growing brokerage, while providing a new standard of service.meet our teamcareersMessage from CEOAt the end of 2020, after working in Dubai real estate for close to 7 years, I was sick of watching companies try and take everything they could from their employees, asking them to pay for their own visas, medicals, real estate licenses, you name it. I noticed that when the brokers had all these stresses, it trickled down to their service. You can be sure a company that won't even invest in a visa for a broker certainly will not train and develop a broker to help the buyers and tenants of Dubai & internationally find a property easily. These added pressures only become a hindrance.\nI do not deny that White & Co Real Estate was formed for the broker, and because of this, we have grown at a rate that has never been seen in Dubai real estate. The age-old saying goes, \"if you look after your employees, then they will look after the client.\"\nAs the fastest growing brokerage in Dubai it would be very easy for us to lose our mission with the excitement but we will not. Consistently improving our tools and broker skills so that they can bring an superior quality of service to each and every client.\nAs we begin 2023, our 3rd year in business, I am very hopeful seeing the changes that are happening in Dubai Real Estate. As the market continues to shift towards a more exclusive and mature one, Real estate agency will stand out and I believe White & Co are a market leader on this front.\nThis is not your standard message from the CEO; Our strengths are that we are hardworking, authentic and hungry for success, which trickles through every part of the company. Simple as that.\n\nCalum WhiteFounder & CEORecent AcoladesAwards & RecognitionBauyt - Agency of the monthSeptember 2021Bauyt - Agent of the month - Wunmi GbadamosiSeptember 2021Property Finder Awards - Rising star ( Nominee)2022Luxury Lifestyle Awards - Best new Luxury Real Estate Brokerage in Dubai2022White & Co in numbersWhite & Co are the Brightest and Fastest growing Real Estate Brokerage Firm in Dubai.160+property experts here to help4.9/5Google rating from 535 Reviews3500+property transactions in 2022Meet the teamYou’re in safe hands PreviousDarren CookeLeasingDavey RoseSalesDavid MarshDubai Marina - Area ManagerDavid JohnSalesDean BratleySalesCallum FosterCalum WhiteFounder & CEONeil MacleanManaging Director Robert SearleSales DirectorDaisy Ford-RobertsonHead Of Recruitment (W&Co Real Estate)Alex GowSalesAmanda McleanSalesAmy JardineLeasingAmy MitchellSalesAnnabel TaeidySalesCallum MurraySalesCamilla BystedSalesConor McElhinneyArea Manager - Palm Jumeirah Darren CookeLeasingDavey RoseSalesDavid MarshDubai Marina - Area ManagerDavid JohnSalesDean BratleySalesCallum FosterCalum WhiteFounder & CEONeil MacleanManaging Director Robert SearleSales DirectorDaisy Ford-RobertsonHead Of Recruitment (W&Co Real Estate)Alex GowSalesAmanda McleanSalesAmy JardineLeasingAmy MitchellSalesAnnabel TaeidySalesCallum MurraySalesCamilla BystedSalesConor McElhinneyArea Manager - Palm Jumeirah Darren CookeLeasingDavey RoseSalesDavid MarshDubai Marina - Area ManagerDavid JohnSalesDean BratleySalesCallum Foster NextExplore White & CoYou may find usefulCareersBe a part of Dubai's fastest growing brokerage.VideosGet to know the team and what White & Co is all about.Customer ReviewsCheckout what our clients are saying about us.Dubai CommunitiesNot sure where to move? Our detailed area guides will help shed some insight.Popular SearchStay up to date with usBy submitting the form, you agree to our Terms & Conditions and Privacy Policy.AboutAboutCustomer ReviewsNews & VideosDubai CommunitiesCareersContactGeneral EnquiryList a PropertySend us your CVMake a complaintSiteTerms & ConditionsPrivacy policyCookie policy© 2023. All Rights ReservedSite by","metadata":{"source":"https://www.whiteandcogroup.com/about-us/","title":"About White & Co","contentLength":570}}]