[{"pageContent":"list a propertyServicesBuyRentSellProperty ManagementMortgagesOff PlanHoliday HomesCommercialaboutAbout UsDubai CommunitiesNewsCareersVideosCustomer ReviewsPeopleContactGeneral EnquiryList a PropertyCareers / Send us your CVLeave A SuggestionAbout White & CoDubai’s fastest growing brokerage, while providing a new standard of service.meet our teamcareersMessage from CEOAt the end of 2020, after working in Dubai real estate for close to 7 years, I was sick of watching companies try and take everything they could from their employees, asking them to pay for their own visas, medicals, real estate licenses, you name it. I noticed that when the brokers had all these stresses, it trickled down to their service. You can be sure a company that won't even invest in a visa for a broker certainly will not train and develop a broker to help the buyers and tenants of Dubai & internationally find a property easily. These added pressures only become a hindrance.\nI do not deny that White & Co Real Estate was formed for the broker, and because of this, we have grown at a rate that has never been seen in Dubai real estate. The age-old saying goes, \"if you look after your employees, then they will look after the client.\"\nAs the fastest growing brokerage in Dubai it would be very easy for us to lose our mission with the excitement but we will not. Consistently improving our tools and broker skills so that they can bring an superior quality of service to each and every client.\nAs we begin 2023, our 3rd year in business, I am very hopeful seeing the changes that are happening in Dubai Real Estate. As the market continues to shift towards a more exclusive and mature one, Real estate agency will stand out and I believe White & Co are a market leader on this front.\nThis is not your standard message from the CEO; Our strengths are that we are hardworking, authentic and hungry for success, which trickles through every part of the company. Simple as that.\n\nCalum WhiteFounder & CEORecent AcoladesAwards & RecognitionBauyt - Agency of the monthSeptember 2021Bauyt - Agent of the month - Wunmi GbadamosiSeptember 2021Property Finder Awards - Rising star ( Nominee)2022Luxury Lifestyle Awards - Best new Luxury Real Estate Brokerage in Dubai2022White & Co in numbersWhite & Co are the Brightest and Fastest growing Real Estate Brokerage Firm in Dubai.160+property experts here to help4.9/5Google rating from 535 Reviews3500+property transactions in 2022Meet the teamYou’re in safe hands PreviousDarren CookeLeasingDavey RoseSalesDavid MarshDubai Marina - Area ManagerDavid JohnSalesDean BratleySalesCallum FosterCalum WhiteFounder & CEONeil MacleanManaging Director Robert SearleSales DirectorDaisy Ford-RobertsonHead Of Recruitment (W&Co Real Estate)Alex GowSalesAmanda McleanSalesAmy JardineLeasingAmy MitchellSalesAnnabel TaeidySalesCallum MurraySalesCamilla BystedSalesConor McElhinneyArea Manager - Palm Jumeirah Darren CookeLeasingDavey RoseSalesDavid MarshDubai Marina - Area ManagerDavid JohnSalesDean BratleySalesCallum FosterCalum WhiteFounder & CEONeil MacleanManaging Director Robert SearleSales DirectorDaisy Ford-RobertsonHead Of Recruitment (W&Co Real Estate)Alex GowSalesAmanda McleanSalesAmy JardineLeasingAmy MitchellSalesAnnabel TaeidySalesCallum MurraySalesCamilla BystedSalesConor McElhinneyArea Manager - Palm Jumeirah Darren CookeLeasingDavey RoseSalesDavid MarshDubai Marina - Area ManagerDavid JohnSalesDean BratleySalesCallum Foster NextExplore White & CoYou may find usefulCareersBe a part of Dubai's fastest growing brokerage.VideosGet to know the team and what White & Co is all about.Customer ReviewsCheckout what our clients are saying about us.Dubai CommunitiesNot sure where to move? Our detailed area guides will help shed some insight.Popular SearchStay up to date with usBy submitting the form, you agree to our Terms & Conditions and Privacy Policy.AboutAboutCustomer ReviewsNews & VideosDubai CommunitiesCareersContactGeneral EnquiryList a PropertySend us your CVMake a complaintSiteTerms & ConditionsPrivacy policyCookie policy© 2023. All Rights ReservedSite by","metadata":{"source":"https://www.whiteandcogroup.com/about-us/","title":"About White & Co","contentLength":570}},{"pageContent":"list a propertyServicesBuyRentSellProperty ManagementMortgagesOff PlanHoliday HomesCommercialaboutAbout UsDubai CommunitiesNewsCareersVideosCustomer ReviewsPeopleContactGeneral EnquiryList a PropertyCareers / Send us your CVLeave A SuggestionHomeNewsWhat’s Coming Up In Dubai This May 2023What’s Coming Up In Dubai This May 2023 1st May 2023 DubaiMay season is beach season! It's getting hot, but we're not quite there with the unbearable heat, so this month is your last chance to get all the outdoor activities ticked off your list in Dubai! Sunshine all day around with pleasant winds in the evening - sounds like the perfect time to soak up some rays in Dubai.\nMay is jam-packed with cultural events that'll make you feel all fancy.\nAs temperatures soar in May, it's best to beat the heat by indulging in water-based activities. \nAquaventure at Atlantis, The Palm or Wild Wadi at Jumeirah Beach Hotel are two must-visit water theme parks adventure that offers a refreshing escape from the scorching heat. \nDubai Parks & Resorts is another must-visit attraction that welcomes all age groups. Little ones will have a blast at Legoland Dubai, while older kids will enjoy the adrenaline-pumping rides at Motiongate. Even the parents can join in on the fun!\nGet your adrenalin pumping with Jet-skiing on Jumeirah Beach - a thrilling adventure you cannot miss in Dubai. It's the perfect way to soak the sun with this city's stunning views as a backdrop, all while cooling off in the tranquil waters of the Arabian Gulf.Dubai Comedy Festival \nGet ready to chuckle off your socks as the Dubai Comedy Festival is back from May 12th to May 21st, 2023. With a lineup of talented comedians, this festival will leave you with laughter. These comedians will have you giggling, snickering, and cackling with their hilarious jokes. With such a superb lineup, the Dubai Comedy Festival promises to be an unforgettable event that will leave you gasping for breath.\nSo grab your friends, mark your calendars, and get ready to LOL through a night of non-stop laughter. \nCheck Out Dubai Comedy Festival\nCheck out another event at the Coca-Cola Arena Dubai on the 6th and 7th of May as we celebrate the epic lineup of Disney Princesses. Disney Princess: The Concert - a musical experience. It's a fully immersive journey into a world of enchanting melodies and spellbinding stories. Live your storybook dreams.\nThe Concert promises to be the event of a lifetime. So don't wait - secure your tickets now and prepare to be enchanted by the magic of Disney.\nCheck Out Coca-Cola Arena Events.\nIf you're a foodie, you will want to attend the Dubai Food Festival, also known as the beach canteen, at Jumeirah Beach until May 7th. This annual event celebrates the diverse culinary scene in Dubai, with over 200 restaurants offering special menus and promotions. The festival also features food trucks, cooking workshops, and live entertainment.\nCheck Out Beach Canteen\nDXB Snow Run 2023's 4th edition is happening, an adrenaline-fueled event organized by the Dubai Sports Council that offers thrill seekers the chance to jog up and down the snowy slopes of Ski Dubai at a chilly -4° Celsius.\nParticipants can choose between a 3- or 5-km course, making it perfect for all fitness levels. Just make sure you're over 15 years old to sign up.\nSo how much does it cost to join the fun? Tickets start from just AED 115 per person, a small price for an unforgettable experience.\nMark your calendars for May 21st, 2023 and head down to Ski Dubai, located in the Mall of the Emirates. The race starts at 06:30 am, gear up and show off your snow-jogging skills.\nCheck Out Ski Dubai Snow RunVisit the Dubai Aquarium and the Underwater Zoo. There are many activities to keep you entertained, from diving with the sharks to catching a boat ride made of glass. Take a break from the scorching desert heat and dive into an aquatic wonderland in the heart of the Dubai Mall. Take the chance to witness feeding presentations and shows of these majestic creatures in action. If you are a marine lover, this place is a must-go-to.\nCheck Out Dubai Aquarium\nMay 2023 is shaping up to be an exciting time to visit Dubai, with a plethora of events and attractions to choose from. Whether you're interested in culture, music, food, or adventure, there's something for everyone in this vibrant city.\nStay tuned with White & Co to learn more exciting facts about events in Dubai. If you are looking to stay in Dubai during May, Check out some of our holiday homes to book. Contact us Now.Share this postOther news that may interest youHow to host a successful open house in Dubai2nd Dec 2022/DubaiWhy should you list your home with a real estate agent in Dubai?2nd Dec 2022/DubaiMost Luxurious Communities in Dubai2nd Dec 2022/DubaiFive reasons why listing exclusively with an agency is better than an open listing4th Jan 2023/DubaiPopular SearchStay up to date with usBy submitting the form, you agree to our Terms & Conditions and Privacy Policy.AboutAboutCustomer ReviewsNews & VideosDubai CommunitiesCareersContactGeneral EnquiryList a PropertySend us your CVMake a complaintSiteTerms & ConditionsPrivacy policyCookie policy© 2023. All Rights ReservedSite by","metadata":{"source":"https://www.whiteandcogroup.com/about-us/latest-property-news/what-s-coming-up-in-dubai-this-may-2023/","title":"What’s Coming Up In Dubai This May 2023","contentLength":882}},{"pageContent":"list a propertyServicesBuyRentSellProperty ManagementMortgagesOff PlanHoliday HomesCommercialaboutAbout UsDubai CommunitiesNewsCareersVideosCustomer ReviewsPeopleContactGeneral EnquiryList a PropertyCareers / Send us your CVLeave A SuggestionHomeNews7 Things To Do In Palm Jumeirah7 Things To Do In Palm Jumeirah 24th Apr 2023 Dubai \nDubai's ultimate signature spot is none other than the iconic Palm Jumeirah. This man-made marvel, shaped like a palm tree, is synonymous with the city's opulence and extravagance. Palm Jumeirah boasts a plethora of luxurious resorts, a fantastic selection of top-notch restaurants, and an abundance of exciting attractions. So, if you're in the mood for some sun-kissed adventures, Palm Jumeirah is undoubtedly the place to be.\n  \nAtlantis The Palm\nCheck out the world-renowned resort, where every detail has been meticulously crafted to provide an unforgettable experience. Savour the flavours of our award-winning celebrity chef restaurants, or let loose at Aquaventure Waterpark, where the thrill never stops.\nTreat yourself to the underwater signature suite for the ultimate luxury, where you can gaze upon exotic marine life from the comfort of your bedroom. The suite boasts three floors of pure extravagance, complete with a private lift, 24-carat gold-flecked soap, 24/7 butler service, and a private spa bath.\nTake to the skies with our private helicopter rides for a truly unique view of the city. Whether you opt for the 'Dubai Skyline Tour', 'Dubai Skyline Premium Tour', or the coveted 'Ultimate Arrival and Departure Experience', you'll enjoy an unrivalled perspective of the sparkling Dubai skyline.\n  \nBeat the heat at Aquaventure Waterpark.\nLooking for a way to beat the heat and have a blast simultaneously? Check out Aquaventure Waterpark. This hotspot offers an exciting mix of thrilling water slides, including famous ones like Blackout, Shockwave, and Trident. And for those seeking an extra adrenaline rush, the Leap of Faith will surely deliver, as it takes you hurtling down a 27.5-meter drop through a transparent tube surrounded by sharks and rays!\nLocated at Atlantis The Palm, Aquaventure Waterpark offers day passes starting at AED 299 per person, with special rates available for UAE residents starting at AED 240. The park is open from 10:00 am to 06:00 pm, so there is plenty of time to soak up the excitement.\n  \nVisit The View At The Palm \nIf you're not afraid of heights, you cannot miss the breathtaking bird's eye view of Dubai and the iconic palm-shaped island from The View at The Palm Jumeirah. Trust us; this experience should be on your bucket list!\nLocation-wise, you can find The View at Nakheel Mall, and it'll only cost you AED 100 per adult, AED 69 for the kids, and even better, entry is free for the little ones who are four years old and under.\nAs for timings, you can visit during non-peak hours from 9:00 am to 9:00 pm, or if you're looking for a more intense rush, hit it up during peak hours from 4:00 pm to 6:30 pm.\n \n  \nShopping spree at Nakheel Mall \nCheck out Nakheel Mall, with over 300 stores stocked with all your favourite international brands; this place is a shopaholic's paradise. And if you need a break from all the retail therapy, don't worry – plenty of entertainment can be found, from a 15-screen cinema complex to other cool attractions across five floors.\nAll that shopping and excitement can work up quite an appetite. Luckily, the rooftop plaza has got you covered. With a wide variety of al fresco dining options, you can chow down on some delicious eats while taking in breathtaking views of Palm Jumeirah.\n  \nThe Pointe\nGet ready to have your taste buds tickled and your senses tantalized at The Pointe, a destination that promises to delight and inspire. Whether you're a foodie or a casual diner, you're in for a treat, with over 80 restaurants, cafés and bars vying for your attention.\nBut that's just the beginning. At The Pointe, you can soak up the sun and sea breeze as you enjoy retail therapy, catch a movie, or relax and unwind with friends and family. And its breathtaking views of Atlantis The Palm, the iconic resort just a stone's throw away.\nWith its sparkling waters and glittering skyline, this Insta-worthy destination is the perfect backdrop for your next adventure. So come on down and discover all that The Pointe has to offer.\n  \nAura Skypool \nA swanky spot to beat the heat in Dubai? The Aura Skypool in Palm Jumeirah is where it's at. Enjoy the stunning city skyline and Arabian Gulf views while relaxing in this infinity pool. Grab a drink from the bar and soak up some rays on a plush sunbed, or cool off with a refreshing dip in the crystal-clear waters. The poolside restaurant's got you covered with tasty bites and thirst-quenching drinks. Whether looking for a lazy day in the sun or a romantic evening under the stars, Aura Skypool's got your back.\n Wave House \nGet ready to take a trip down memory lane at Wavehouse; this destination has everything from retro games to a fun gastropub atmosphere, perfect for a day out with friends or family.\nThe Wavehouse Dubai restaurant serves various tasty treats to suit all your cravings, whether you're in the mood for something healthy or a bit more indulgent. They've got everything from fresh salads to pizzas, burgers and a special menu for kids.\nBut the real highlight of Wavehouse Dubai is the artificial wave machine - perfect for anyone looking to catch some waves without hitting the beach. And after all that surfing, you can chill out at the outdoor bar or soak up the rays on the sunny terrace. If you want to ride the waves, you can get an unlimited access pass for the Surf Up Wave Rider for AED 100 per person. But even if you're not into water sports, there's still plenty to do - like checking out the four-lane bowling alley with its funky 3D projections. \nFor even more fun, head to LEVELS - a play area that will take your excitement to new heights. With five levels packed full of retro arcade games, climbing frames, and even a virtual reality zombie game, there's something for everyone to enjoy. And at AED 75 per person for a full day, it's worth checking out. Remember that the soft play area has a minimum height requirement of one metre.\nPalm Jumeirah is a destination that truly has it all. From thrilling waterparks to stunning views, world-class shopping, and delicious dining options, this man-made wonder is a must-visit for anyone looking for an adventure-filled holiday. Whether you're a shopaholic or a foodie, there's something for everyone here. So pack your bags, grab your sunglasses, and prepare for an unforgettable Palm Jumeirah experience.\n \nStay tuned with White & Co to learn more interesting facts about iconic landmarks in Palm Jumeirah, Dubai. Looking for Properties in Palm Jumeirah, Contact White & Co Now.Share this postOther news that may interest youHow to host a successful open house in Dubai2nd Dec 2022/DubaiWhy should you list your home with a real estate agent in Dubai?2nd Dec 2022/DubaiMost Luxurious Communities in Dubai2nd Dec 2022/DubaiFive reasons why listing exclusively with an agency is better than an open listing4th Jan 2023/DubaiPopular SearchStay up to date with usBy submitting the form, you agree to our Terms & Conditions and Privacy Policy.AboutAboutCustomer ReviewsNews & VideosDubai CommunitiesCareersContactGeneral EnquiryList a PropertySend us your CVMake a complaintSiteTerms & ConditionsPrivacy policyCookie policy© 2023. All Rights ReservedSite by","metadata":{"source":"https://www.whiteandcogroup.com/about-us/latest-property-news/7-things-to-do-in-palm-jumeirah/","title":"7 Things To Do In Palm Jumeirah","contentLength":1283}},{"pageContent":"list a propertyServicesBuyRentSellProperty ManagementMortgagesOff PlanHoliday HomesCommercialaboutAbout UsDubai CommunitiesNewsCareersVideosCustomer ReviewsPeopleContactGeneral EnquiryList a PropertyCareers / Send us your CVLeave A SuggestionHomeNewsApril in Dubai: Month of FestivitiesApril in Dubai: Month of Festivities 6th Apr 2023 DubaiDubai is ready to take you on a wild ride with its thrilling list of events and activities this April. This stunning city has a lot to offer, from Ramadan night markets to cultural festivals. Here are some must-visit events and activities in Dubai; \nEaster Egg Hunt at Dubai Parks and Resorts\nIf you are celebrating Easter, mark your calendars for April 8th 2023, and head to Dubai Parks and Resorts for the biggest egg hunt in the region. Despite daytime fasting, Easter Sunday Brunches and other family events will still occur across Dubai over the Easter weekend.\nDubai Parks & Resorts - Easter Egg Hunt \nRamadan Night Market\nThe Holy Month of Ramadan is the most significant event in the Islamic calendar, ending on April 21st 2023. Dubai has various activities in unique locations, from fireworks to iftar and suhoor spreads. \nOne such event is the Ramadan Night Market at the Dubai World Trade Centre between the 9th and 18th of April.\nAl Marmoom Heritage Festival\nIf you want to experience authentic Emirati culture, you can't miss the Al Marmoom Heritage Festival. A two-week festival celebrates traditional Emirati culture with music, crafts, food, and camel rides. The main focus, however, is the camel race. The festival is one of the most significant Gulf Camel Racing events.\nApril 6th - 18th, 2023\nLocation: Al Marmoom Heritage Village \n Global Village Dubai\nAt Global Village, different cultures come together from all around the world. A multicultural festival park is the region's first family destination for culture, shopping, and entertainment. There are more than 90 cultures showcasing their local products within their pavilions and over 150+ rides, games and attractions. For foodies, visiting a global village is a must; different international cuisines are onsite at various restaurants, cafes, and street food kiosks. Children and adults love the bright lights and lively atmosphere created by parades and various shows, from fire street performances to star-studded concerts. The season's last day of Global Village is April 29th, 2023.\n Dubai Polo Cup Series\nPolo enthusiasts should visit and check out the Dubai polo cup series, which will take place from the 22nd – April 29th, 2023. The event features some of the world's top polo players competing at the Al Habtoor Polo Resort and Club. Plenty of other activities and entertainment for attendees make it a fun day with your loved ones. Admission to the event is free, so take advantage of this opportunity to witness some of the best polo action in the world.\nDubai World Cup\n \nBig Bad Wolf Book Sale\nThe Big Bad Wolf Book Sale is coming to Dubai in April 2023, known as the world's biggest book fair. This event is a haven for book lovers, with a vast selection of genres. Take advantage of this fantastic opportunity to purchase your favourite books at a discount of 50%-90%. Admission is free, and the event will start from the 7th to the 16th of April 2023 at the Sound Stages in Dubai Studio City. The event will occur all day, so you can shop to your heart's content anytime that suits you. Take advantage of this fantastic chance to add to your library.Coming Soon | Big Bad Wolf Books\n \nIn conclusion, April 2023 is a month of festivities, with plenty of activities and events to suit every taste. Whether you're a book lover, a polo enthusiast, or simply looking to explore the rich culture of the UAE, there's something for everyone. So, pack your bags and head to Dubai for an unforgettable experience you'll cherish forever.Share this postOther news that may interest youHow to host a successful open house in Dubai2nd Dec 2022/DubaiWhy should you list your home with a real estate agent in Dubai?2nd Dec 2022/DubaiMost Luxurious Communities in Dubai2nd Dec 2022/DubaiFive reasons why listing exclusively with an agency is better than an open listing4th Jan 2023/DubaiPopular SearchStay up to date with usBy submitting the form, you agree to our Terms & Conditions and Privacy Policy.AboutAboutCustomer ReviewsNews & VideosDubai CommunitiesCareersContactGeneral EnquiryList a PropertySend us your CVMake a complaintSiteTerms & ConditionsPrivacy policyCookie policy© 2023. All Rights ReservedSite by","metadata":{"source":"https://www.whiteandcogroup.com/about-us/latest-property-news/april-in-dubai-month-of-festivities/","title":"April in Dubai: Month of Festivities","contentLength":730}}]